chronoweb/src/main/resources/webroot/example/query/Unsubscribe/Unsubscribe_3.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:query="urn:epcglobal:epcis-query:xsd:1"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header />
	<soapenv:Body>
		<query:Unsubscribe>
			<subscriptionID>3</subscriptionID>
		</query:Unsubscribe>
	</soapenv:Body>
</soapenv:Envelope>