chronoweb/src/main/resources/webroot/example/subscribe/Subscribe/2Subscribe_aggregation_events_for_every_10seconds.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:query="urn:epcglobal:epcis-query:xsd:1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header/>
    <soapenv:Body>
        <query:Subscribe>
            <!-- This subscription 2 will deliver all the aggregation events for every 10 seconds even if there is no such event -->
            <!-- to the http://localhost/epcis/test -->
            <queryName>SimpleEventQuery</queryName>
            <params>
                <param>
                    <name>eventType</name>
                    <value xsi:type="query:ArrayOfString">
                        <string>AggregationEvent</string>
                    </value>
                </param>
            </params>
            <dest>http://localhost:8082/epcis/test</dest>
            <controls>
                <schedule>
                    <second>0/10</second>
                </schedule>
                <reportIfEmpty>true</reportIfEmpty>
            </controls>
            <subscriptionID>2</subscriptionID>
        </query:Subscribe>
    </soapenv:Body>
</soapenv:Envelope>